In [27]:
import yfinance as yf
import pandas as pd
import requests
from bs4 import BeautifulSoup as soup
import plotly.graph_objects as go
import plotly.io as pio
from plotly.subplots import make_subplots

In [4]:
def make_graph(stock_data, revenue_data, stock):
    fig = make_subplots(rows=2, cols=1, shared_xaxes=True, subplot_titles=("Historical Share Price", "Historical Revenue"), vertical_spacing = .3)
    fig.add_trace(go.Scatter(x=pd.to_datetime(stock_data.Date, infer_datetime_format=True), y=stock_data.Close.astype("float"), name="Share Price"), row=1, col=1)
    fig.add_trace(go.Scatter(x=pd.to_datetime(revenue_data.Date, infer_datetime_format=True), y=revenue_data.Revenue.astype("float"), name="Revenue"), row=2, col=1)
    fig.update_xaxes(title_text="Date", row=1, col=1)
    fig.update_xaxes(title_text="Date", row=2, col=1)
    fig.update_yaxes(title_text="Price ($US)", row=1, col=1)
    fig.update_yaxes(title_text="Revenue ($US Millions)", row=2, col=1)
    fig.update_layout(showlegend=False,
    height=900,
    title=stock,
    xaxis_rangeslider_visible=True)
    fig.show()

In [5]:
tesla = yf.Ticker("TSLA")

In [6]:
tesla_data = tesla.history(period="max")

In [7]:
tesla_data.reset_index(inplace=True)
tesla_data.head()

        Date   Open   High    Low  Close    Volume  Dividends  Stock Splits
0 2010-06-29  3.800  5.000  3.508  4.778  93831500          0           0.0
1 2010-06-30  5.158  6.084  4.660  4.766  85935500          0           0.0
2 2010-07-01  5.000  5.184  4.054  4.392  41094000          0           0.0
3 2010-07-02  4.600  4.620  3.742  3.840  25699000          0           0.0
4 2010-07-06  4.000  4.000  3.166  3.222  34334500          0           0.0

In [8]:
from urllib.request import urlopen as uReq
my_url_tsla = ' https://www.macrotrends.net/stocks/charts/TSLA/tesla/revenue'
uClient = uReq(my_url_tsla)
html_data = uClient.read()
uClient.close()

In [9]:
page_soup_tsla = soup(html_data, "html.parser")

In [10]:
tesla_revenue = pd.DataFrame(columns=["Date", "Revenue"])

tesla_data_html = page_soup_tsla.findAll("div",{"class":"col-xs-6"})[1].find("tbody").find_all("tr")
for row in tesla_data_html:
    col = row.find_all("td")
    date =col[0].text
    revenue = col[1].text.replace("$", "").replace(",", "")
    
    tesla_revenue = tesla_revenue.append({"Date":date, "Revenue": revenue}, ignore_index=True)

In [11]:
tesla_revenue

          Date Revenue
0   2021-03-31   10389
1   2020-12-31   10744
2   2020-09-30    8771
3   2020-06-30    6036
4   2020-03-31    5985
5   2019-12-31    7384
6   2019-09-30    6303
7   2019-06-30    6350
8   2019-03-31    4541
9   2018-12-31    7226
10  2018-09-30    6824
11  2018-06-30    4002
12  2018-03-31    3409
13  2017-12-31    3288
14  2017-09-30    2985
15  2017-06-30    2790
16  2017-03-31    2696
17  2016-12-31    2285
18  2016-09-30    2298
19  2016-06-30    1270
20  2016-03-31    1147
21  2015-12-31    1214
22  2015-09-30     937
23  2015-06-30     955
24  2015-03-31     940
25  2014-12-31     957
26  2014-09-30     852
27  2014-06-30     769
28  2014-03-31     621
29  2013-12-31     615
30  2013-09-30     431
31  2013-06-30     405
32  2013-03-31     562
33  2012-12-31     306
34  2012-09-30      50
35  2012-06-30      27
36  2012-03-31      30
37  2011-12-31      39
38  2011-09-30      58
39  2011-06-30      58
40  2011-03-31      49
41  2010-12-31      36
42  2010-09-30      31
43  2010-06-30      28
44  2010-03-31      21
45  2009-12-31
46  2009-09-30      46
47  2009-06-30      27
48  2008-12-31

In [12]:
tesla_revenue.dtypes

Date       object
Revenue    object
dtype: object

In [13]:
# tesla_revenue['Revenue'] = tesla_revenue.Revenue.astype(float)
tesla_revenue["Revenue"] = pd.to_numeric(tesla_revenue["Revenue"], downcast="float")
tesla_revenue.tail(5)

          Date  Revenue
44  2010-03-31     21.0
45  2009-12-31      NaN
46  2009-09-30     46.0
47  2009-06-30     27.0
48  2008-12-31      NaN

In [14]:
GameStop = yf.Ticker("GME")

In [15]:
gme_data = GameStop.history(period="max")

In [16]:
gme_data.reset_index(inplace=True)
gme_data.head()

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
0,2002-02-13,6.480513,6.773399,6.413183,6.766666,19054000,0.0,0.0
1,2002-02-14,6.850831,6.864296,6.682506,6.733003,2755400,0.0,0.0
2,2002-02-15,6.733001,6.749833,6.632006,6.699336,2097400,0.0,0.0
3,2002-02-19,6.665671,6.665671,6.312189,6.430017,1852600,0.0,0.0
4,2002-02-20,6.463681,6.648838,6.413183,6.648838,1723200,0.0,0.0

In [17]:
from urllib.request import urlopen as uReq
my_url_gme = 'https://www.macrotrends.net/stocks/charts/GME/gamestop/revenue'
uClient = uReq(my_url_gme)
html_data = uClient.read()
uClient.close()

In [19]:
page_soup_gme = soup(html_data, "html.parser")

In [20]:
gme_revenue = pd.DataFrame(columns=["Date", "Revenue"])

gme_data_html = page_soup_gme.findAll("div",{"class":"col-xs-6"})[1].find("tbody").find_all("tr")
for row in gme_data_html:
    col = row.find_all("td")
    date =col[0].text
    revenue = col[1].text.replace("$", "").replace(",", "")
    
    gme_revenue = gme_revenue.append({"Date":date, "Revenue":revenue}, ignore_index=True)

In [21]:
gme_revenue

          Date Revenue
0   2021-04-30    1277
1   2021-01-31    2122
2   2020-10-31    1005
3   2020-07-31     942
4   2020-04-30    1021
..         ...     ...
61  2006-01-31    1667
62  2005-10-31     534
63  2005-07-31     416
64  2005-04-30     475
65  2005-01-31     709

[66 rows x 2 columns]

In [22]:
gme_revenue['Revenue'] = pd.to_numeric(gme_revenue['Revenue'], downcast="float")
# gme_revenue['Revenue'] = gme_revenue.Revenue.astype(float)

In [23]:
gme_revenue.tail(5)

          Date  Revenue
61  2006-01-31   1667.0
62  2005-10-31    534.0
63  2005-07-31    416.0
64  2005-04-30    475.0
65  2005-01-31    709.0